# Leet Code

#### Second Highest Salary

```sql
SELECT (SELECT DISTINCT salary
FROM employee
ORDER BY salary DESC
LIMIT 1
OFFSET 1) as SecondHighestSalary
```

```sql
SELECT 
    IFNULL((SELECT DISTINCT salary
    FROM employee
    ORDER BY salary DESC
    LIMIT 1
    OFFSET 1, NULL)) as SecondHighestSalary
```

#### Duplicate Emails

```sql
SELECT email
FROM person
GROUP BY email
HAVING COUNT(email) > 1
```

#### Employees Earn More Than Manager

```sql
SELECT a.name AS Employee
FROM employee AS a, employee as B
WHERE a.ManagerId = b.Id AND a.Salary > b.Salary;
```

#### Customers Who Never Order

```sql
SELECT Name AS Customers
FROM Customers
WHERE Id NOT IN (SELECT CustomerId FROM Orders);
```

#### Delete Duplicate Emails

```sql
DELETE p1 FROM person p1, person p2
WHERE p1.email = p2.email AND p1.Id > p2.Id;
```

#### Big Countries

```sql
SELECT name, population, area
FROM world 
WHERE area > 3000000 OR population > 25000000;
```

### Swap Salaries

#### Leet Code Solution

```sql
UPDATE salary
SET
    sex = CASE sex
        WHEN 'm' THEN 'f'
        ELSE 'm'
    END;
```

### Not Boring Movies

#### My solution

```sql
SELECT * 
FROM cinema
WHERE id % 2 != 0 AND description NOT LIKE '%boring%'
ORDER BY rating DESC;
```

### Rising Temperatures

```sql
SELECT w1.id 
FROM weather w1
    JOIN weather w2 ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
WHERE w1.temperature > w2.temperature
```

### Classes More than 5 Students

```sql
SELECT class
FROM courses
GROUP BY class
HAVING COUNT(DISTINCT(student)) >= 5;
```

### Reformat Department Table

```sql
SELECT id,
    SUM(CASE WHEN month = 'Jan' THEN revenue END) AS Jan_Revenue
    SUM(CASE WHEN month = 'Feb' THEN revenue END) AS Feb_Revenue
    SUM(CASE WHEN month = 'Mar' THEN revenue END) AS Mar_Revenue
    SUM(CASE WHEN month = 'Apr' THEN revenue END) AS Apr_Revenue
    SUM(CASE WHEN month = 'May' THEN revenue END) AS May_Revenue
    SUM(CASE WHEN month = 'Jun' THEN revenue END) AS Jun_Revenue
    SUM(CASE WHEN month = 'Jul' THEN revenue END) AS Jul_Revenue
    SUM(CASE WHEN month = 'Aug' THEN revenue END) AS Aug_Revenue
    SUM(CASE WHEN month = 'Sep' THEN revenue END) AS Sep_Revenue
    SUM(CASE WHEN month = 'Oct' THEN revenue END) AS Oct_Revenue
    SUM(CASE WHEN month = 'Nov' THEN revenue END) AS Nov_Revenue
    SUM(CASE WHEN month = 'Dec' THEN revenue END) AS Dec_Revenue
FROM department
GROUP BY id;
```

#### Department Highest Salary

```sql
SELECT d.name AS Department, e.Name AS Employee, e.Salary 
FROM employee e
    JOIN department d ON d.id = e.DepartmentId
WHERE (e.DepartmentId, e.Salary) IN (SELECT DepartmentId, MAX(Salary) FROM employee GROUP BY DepartmentId);

```

#### Rank Scores

```sql
SELECT score, DENSE_RANK() OVER(ORDER BY score DESC) AS 'Rank'
FROM scores
ORDER BY score DESC;
```

#### Get Nth Highest Salary

```sql
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
SET N = N-1;
  RETURN (
      SELECT DISTINCT salary
      FROM employee
      ORDER BY salary DESC
      LIMIT 1
      OFFSET N);
  END
```

### Human Traffic of Stadium

Leetcode Solution Walkthrough

```sql
SELECT DISTINCT s1.*
FROM stadium s1, stadium s2, stadium s3
WHERE s1.people >= 100 AND s2.people >= 100 and s3. people >= 100 AND
((s1.id - s2.id = 1 AND s1.id - s3.id = 2 AND s2.id - s3.id = 1) OR
 (s2.id - s1.id = 1 AND s2.id - s3.id = 2 AND s1.id - s3.id = 1) OR
 (s3.id - s2.id = 1 AND s2.id - s1.id = 1 AND s3.id - s1.id = 2))
ORDER BY s1.id;
```

# Hacker Rank

```sql
SELECT hacker_id, name
FROM hackers h
    JOIN challenges c ON c.hacker_id = h.hacker_id
    JOIN submissions
```

#### Olivander's Inventory

```sql
SELECT W.id, P.age, W.coins_needed, W.power
FROM WANDS AS W
    INNER JOIN WANDS_PROPERTY AS P ON W.code = P.code
WHERE P.is_evil = 0 AND W.coins_needed = 
    (SELECT MIN(coins_needed)
     FROM WANDS AS W1
        INNER JOIN WANDS_PROPERTY AS P1 ON W1.code = P1.code
     WHERE W1.power = W.power AND P1.age = P.age)
ORDER BY W.power DESC, P.age DESC
```

#### Contest Leaderboard

```sql
SELECT h.hacker_id, h.name, SUM(s2.high_score) as total_score
FROM hackers h
    JOIN (SELECT s.hacker_id, MAX(s.score) as high_score FROM submissions s
     GROUP BY s.challenge_id, s.hacker_id) AS s2
     ON h.hacker_id = s2.hacker_id
WHERE s2.high_score > 0
GROUP BY h.hacker_id, h.name
ORDER BY total_score DESC, h.hacker_id;
```

## Data Interview Q's
### Airbnb stays by country
Suppose you work for Airbnb as an analyst. A team has come to you asking for a ranked list containing total # stays as well as total revenue, split by country. The time frame they're looking for is all stays that began in 2018. You can sort the list in descending order by revenue.

```sql
SELECT pl.country, COUNT(s.property_id) AS total_stays, SUM(s.revenue) AS total_revenue
FROM stays_info s
    JOIN property_location_info pl ON s.property_id = pl.property_id
GROUP BY pl.country
ORDER BY total_revenue DESC
```

## Code Wars

### Trivia Night: Country Capitals

```sql
SELECT capital 
FROM countries
WHERE continent IN ('Africa', 'Afrika') and country ILIKE 'E%'
ORDER BY capital
LIMIT 3;
```

### Top 10 Customers by Payment Amount

```sql
SELECT c.customer_id, c.email, COUNT(p.payment_id) AS payments_count, CAST(SUM(amount) AS FLOAT) AS total_amount
FROM customer c
  JOIN payment p ON p.customer_id = c.customer_id
GROUP BY c.customer_id
ORDER BY total_amount DESC
LIMIT 10;
```

### Batting Average

```sql
SELECT player_name, SUM(games) AS games, CAST(ROUND(SUM(hits) * 1.0 / SUM(at_bats), 3) AS VARCHAR) AS batting_average
FROM yankees
GROUP BY player_name, games
HAVING SUM(at_bats) >= 100
ORDER BY batting_average DESC;
```

### SQL Statistics: Min, Median, Max

```sql
SELECT MIN(score) AS min, PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY score)  AS median, MAX(SCORE) AS max
FROM student s
JOIN result r ON s.id = r.student_id
```

### Conditional Count

```sql
SELECT 
    EXTRACT(MONTH FROM payment_date) AS month,
    COUNT(*) AS total_count,
    SUM(amount) AS total_amount,
    COUNT(*) FILTER (WHERE staff_id = 1) AS mike_count,
    SUM(AMOUNT) FILTER (WHERE staff_id = 1) AS mike_amount,
    COUNT(*) FILTER (WHERE staff_id =  2) AS jon_count,
    SUM(amount) FILTER (WHERE staff_id = 2) AS jon_amount
FROM payment
GROUP BY month
ORDER BY month;
```

### Best-Selling Books

```sql
SELECT name, author, copies_sold
FROM books
ORDER BY copies_sold DESC
LIMIT 5;
```